OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f752.h
#define _SLRA0                  0x01
#define _SLRA2                  0x04

//==============================================================================


//==============================================================================
//        PCON Bits

extern __at(0x010F) __sfr PCON;

typedef struct
  {
  unsigned NOT_BOR              : 1;
  unsigned NOT_POR              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PCONbits_t;

extern __at(0x010F) volatile __PCONbits_t PCONbits;

#define _NOT_BOR                0x01
#define _NOT_POR                0x02

//==============================================================================

extern __at(0x0110) __sfr TMR2;
extern __at(0x0111) __sfr PR2;

//==============================================================================
//        T2CON Bits

extern __at(0x0112) __sfr T2CON;

typedef union
  {
  struct
    {
    unsigned T2CKPS0            : 1;
    unsigned T2CKPS1            : 1;
    unsigned TMR2ON             : 1;
    unsigned T2OUTPS0           : 1;
    unsigned T2OUTPS1           : 1;
    unsigned T2OUTPS2           : 1;
    unsigned T2OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T2CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T2OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T2CONbits_t;

extern __at(0x0112) volatile __T2CONbits_t T2CONbits;

#define _T2CKPS0                0x01
#define _T2CKPS1                0x02
#define _TMR2ON                 0x04
#define _T2OUTPS0               0x08
#define _T2OUTPS1               0x10
#define _T2OUTPS2               0x20
#define _T2OUTPS3               0x40

//==============================================================================

extern __at(0x0113) __sfr HLTMR1;
extern __at(0x0114) __sfr HLTPR1;

//==============================================================================
//        HLT1CON0 Bits

extern __at(0x0115) __sfr HLT1CON0;

typedef union
  {
  struct
    {
    unsigned H1CKPS0            : 1;
    unsigned H1CKPS1            : 1;
    unsigned H1ON               : 1;
    unsigned H1OUTPS0           : 1;
    unsigned H1OUTPS1           : 1;
    unsigned H1OUTPS2           : 1;
    unsigned H1OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned H1CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned H1OUTPS            : 4;
    unsigned                    : 1;
    };
  } __HLT1CON0bits_t;

extern __at(0x0115) volatile __HLT1CON0bits_t HLT1CON0bits;

#define _H1CKPS0                0x01
#define _H1CKPS1                0x02
#define _H1ON                   0x04
#define _H1OUTPS0               0x08
#define _H1OUTPS1               0x10
#define _H1OUTPS2               0x20
#define _H1OUTPS3               0x40

//==============================================================================


//==============================================================================
//        HLT1CON1 Bits

extern __at(0x0116) __sfr HLT1CON1;

typedef union
  {
  struct
    {
    unsigned H1REREN            : 1;
    unsigned H1FEREN            : 1;
    unsigned H1ERS0             : 1;
    unsigned H1ERS1             : 1;
    unsigned H1ERS2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned H1ERS              : 3;
    unsigned                    : 3;
    };
  } __HLT1CON1bits_t;

extern __at(0x0116) volatile __HLT1CON1bits_t HLT1CON1bits;

#define _H1REREN                0x01
#define _H1FEREN                0x02
#define _H1ERS0                 0x04
#define _H1ERS1                 0x08
#define _H1ERS2                 0x10

//==============================================================================


//==============================================================================
//        ANSELA Bits

extern __at(0x0185) __sfr ANSELA;

typedef struct
  {
  unsigned ANSA0                : 1;
  unsigned ANSA1                : 1;
  unsigned ANSA2                : 1;
  unsigned                      : 1;
  unsigned ANSA4                : 1;
  unsigned ANSA5                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __ANSELAbits_t;

extern __at(0x0185) volatile __ANSELAbits_t ANSELAbits;

#define _ANSA0                  0x01
#define _ANSA1                  0x02
#define _ANSA2                  0x04
#define _ANSA4                  0x10
#define _ANSA5                  0x20

//==============================================================================


//==============================================================================
//        APFCON Bits

extern __at(0x0188) __sfr APFCON;

typedef struct
  {
  unsigned COG1O0SEL            : 1;
  unsigned COG1O1SEL            : 1;
  unsigned COG1FSEL             : 1;
  unsigned                      : 1;
  unsigned T1GSEL               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __APFCONbits_t;

extern __at(0x0188) volatile __APFCONbits_t APFCONbits;

#define _COG1O0SEL              0x01
#define _COG1O1SEL              0x02
#define _COG1FSEL               0x04
#define _T1GSEL                 0x10

//==============================================================================


//==============================================================================
//        OSCTUNE Bits

extern __at(0x0189) __sfr OSCTUNE;

typedef union
  {
  struct
    {
    unsigned TUN0               : 1;
    unsigned TUN1               : 1;
    unsigned TUN2               : 1;
    unsigned TUN3               : 1;
    unsigned TUN4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TUN                : 5;
    unsigned                    : 3;
    };
  } __OSCTUNEbits_t;

