OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f752.h
extern __at(0x0189) volatile __OSCTUNEbits_t OSCTUNEbits;

#define _TUN0                   0x01
#define _TUN1                   0x02
#define _TUN2                   0x04
#define _TUN3                   0x08
#define _TUN4                   0x10

//==============================================================================


//==============================================================================
//        PMCON1 Bits

extern __at(0x018C) __sfr PMCON1;

typedef struct
  {
  unsigned RD                   : 1;
  unsigned WR                   : 1;
  unsigned WREN                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PMCON1bits_t;

extern __at(0x018C) volatile __PMCON1bits_t PMCON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04

//==============================================================================

extern __at(0x018D) __sfr PMCON2;
extern __at(0x018E) __sfr PMADR;
extern __at(0x018E) __sfr PMADRL;
extern __at(0x018F) __sfr PMADRH;
extern __at(0x0190) __sfr PMDAT;
extern __at(0x0190) __sfr PMDATL;
extern __at(0x0191) __sfr PMDATH;

//==============================================================================
//        COG1PH Bits

extern __at(0x0192) __sfr COG1PH;

typedef union
  {
  struct
    {
    unsigned G1PH0              : 1;
    unsigned G1PH1              : 1;
    unsigned G1PH2              : 1;
    unsigned G1PH3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PH               : 4;
    unsigned                    : 4;
    };
  } __COG1PHbits_t;

extern __at(0x0192) volatile __COG1PHbits_t COG1PHbits;

#define _G1PH0                  0x01
#define _G1PH1                  0x02
#define _G1PH2                  0x04
#define _G1PH3                  0x08

//==============================================================================


//==============================================================================
//        COG1BLK Bits

extern __at(0x0193) __sfr COG1BLK;

typedef union
  {
  struct
    {
    unsigned G1BLKF0            : 1;
    unsigned G1BLKF1            : 1;
    unsigned G1BLKF2            : 1;
    unsigned G1BLKF3            : 1;
    unsigned G1BLKR0            : 1;
    unsigned G1BLKR1            : 1;
    unsigned G1BLKR2            : 1;
    unsigned G1BLKR3            : 1;
    };

  struct
    {
    unsigned G1BLKF             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G1BLKR             : 4;
    };
  } __COG1BLKbits_t;

extern __at(0x0193) volatile __COG1BLKbits_t COG1BLKbits;

#define _G1BLKF0                0x01
#define _G1BLKF1                0x02
#define _G1BLKF2                0x04
#define _G1BLKF3                0x08
#define _G1BLKR0                0x10
#define _G1BLKR1                0x20
#define _G1BLKR2                0x40
#define _G1BLKR3                0x80

//==============================================================================


//==============================================================================
//        COG1DB Bits

extern __at(0x0194) __sfr COG1DB;

typedef union
  {
  struct
    {
    unsigned G1DBF0             : 1;
    unsigned G1DBF1             : 1;
    unsigned G1DBF2             : 1;
    unsigned G1DBF3             : 1;
    unsigned G1BDR0             : 1;
    unsigned G1BDR1             : 1;
    unsigned G1BDR2             : 1;
    unsigned G1BDR3             : 1;
    };

  struct
    {
    unsigned G1DBF              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G1BDR              : 4;
    };
  } __COG1DBbits_t;

extern __at(0x0194) volatile __COG1DBbits_t COG1DBbits;

#define _G1DBF0                 0x01
#define _G1DBF1                 0x02
#define _G1DBF2                 0x04
#define _G1DBF3                 0x08
#define _G1BDR0                 0x10
#define _G1BDR1                 0x20
#define _G1BDR2                 0x40
#define _G1BDR3                 0x80

//==============================================================================


//==============================================================================
//        COG1CON0 Bits

extern __at(0x0195) __sfr COG1CON0;

typedef union
  {
  struct
    {
    unsigned G1CS0              : 1;
    unsigned G1CS1              : 1;
    unsigned G1LD               : 1;
    unsigned G1POL0             : 1;
    unsigned G1POL1             : 1;
    unsigned G1OE0              : 1;
    unsigned G1OE1              : 1;
    unsigned G1EN               : 1;
    };

  struct
    {
    unsigned G1CS               : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G1POL              : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned G1OE               : 2;
    unsigned                    : 1;
    };
  } __COG1CON0bits_t;

extern __at(0x0195) volatile __COG1CON0bits_t COG1CON0bits;

#define _G1CS0                  0x01
#define _G1CS1                  0x02
#define _G1LD                   0x04
#define _G1POL0                 0x08
#define _G1POL1                 0x10
#define _G1OE0                  0x20
#define _G1OE1                  0x40
#define _G1EN                   0x80

//==============================================================================


//==============================================================================
//        COG1CON1 Bits

extern __at(0x0196) __sfr COG1CON1;

typedef union
  {
  struct
    {
    unsigned G1RS0              : 1;
    unsigned G1RS1              : 1;
    unsigned G1RS2              : 1;
    unsigned G1FS0              : 1;
    unsigned G1FS1              : 1;
    unsigned G1FS2              : 1;
    unsigned G1RSIM             : 1;
    unsigned G1FSIM             : 1;
    };

  struct
    {
    unsigned G1RS               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G1FS               : 3;
    unsigned                    : 2;
    };
  } __COG1CON1bits_t;

