OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f752.h
#define G1ASDSFLT               COG1ASDbits.G1ASDSFLT           // bit 0
#define G1ASDSC1                COG1ASDbits.G1ASDSC1            // bit 1
#define G1ASDSC2                COG1ASDbits.G1ASDSC2            // bit 2
#define G1ASDSHLT               COG1ASDbits.G1ASDSHLT           // bit 3
#define G1ASDL0                 COG1ASDbits.G1ASDL0             // bit 4
#define G1ASDL1                 COG1ASDbits.G1ASDL1             // bit 5
#define G1ARSEN                 COG1ASDbits.G1ARSEN             // bit 6
#define G1ASDE                  COG1ASDbits.G1ASDE              // bit 7

#define G1BLKF0                 COG1BLKbits.G1BLKF0             // bit 0
#define G1BLKF1                 COG1BLKbits.G1BLKF1             // bit 1
#define G1BLKF2                 COG1BLKbits.G1BLKF2             // bit 2
#define G1BLKF3                 COG1BLKbits.G1BLKF3             // bit 3
#define G1BLKR0                 COG1BLKbits.G1BLKR0             // bit 4
#define G1BLKR1                 COG1BLKbits.G1BLKR1             // bit 5
#define G1BLKR2                 COG1BLKbits.G1BLKR2             // bit 6
#define G1BLKR3                 COG1BLKbits.G1BLKR3             // bit 7

#define G1CS0                   COG1CON0bits.G1CS0              // bit 0
#define G1CS1                   COG1CON0bits.G1CS1              // bit 1
#define G1LD                    COG1CON0bits.G1LD               // bit 2
#define G1POL0                  COG1CON0bits.G1POL0             // bit 3
#define G1POL1                  COG1CON0bits.G1POL1             // bit 4
#define G1OE0                   COG1CON0bits.G1OE0              // bit 5
#define G1OE1                   COG1CON0bits.G1OE1              // bit 6
#define G1EN                    COG1CON0bits.G1EN               // bit 7

#define G1RS0                   COG1CON1bits.G1RS0              // bit 0
#define G1RS1                   COG1CON1bits.G1RS1              // bit 1
#define G1RS2                   COG1CON1bits.G1RS2              // bit 2
#define G1FS0                   COG1CON1bits.G1FS0              // bit 3
#define G1FS1                   COG1CON1bits.G1FS1              // bit 4
#define G1FS2                   COG1CON1bits.G1FS2              // bit 5
#define G1RSIM                  COG1CON1bits.G1RSIM             // bit 6
#define G1FSIM                  COG1CON1bits.G1FSIM             // bit 7

#define G1DBF0                  COG1DBbits.G1DBF0               // bit 0
#define G1DBF1                  COG1DBbits.G1DBF1               // bit 1
#define G1DBF2                  COG1DBbits.G1DBF2               // bit 2
#define G1DBF3                  COG1DBbits.G1DBF3               // bit 3
#define G1BDR0                  COG1DBbits.G1BDR0               // bit 4
#define G1BDR1                  COG1DBbits.G1BDR1               // bit 5
#define G1BDR2                  COG1DBbits.G1BDR2               // bit 6
#define G1BDR3                  COG1DBbits.G1BDR3               // bit 7

#define G1PH0                   COG1PHbits.G1PH0                // bit 0
#define G1PH1                   COG1PHbits.G1PH1                // bit 1
#define G1PH2                   COG1PHbits.G1PH2                // bit 2
#define G1PH3                   COG1PHbits.G1PH3                // bit 3

#define DACPSS0                 DACCON0bits.DACPSS0             // bit 2
#define DACOE                   DACCON0bits.DACOE               // bit 5
#define DACRNG                  DACCON0bits.DACRNG              // bit 6
#define DACEN                   DACCON0bits.DACEN               // bit 7

#define DACR0                   DACCON1bits.DACR0               // bit 0
#define DACR1                   DACCON1bits.DACR1               // bit 1
#define DACR2                   DACCON1bits.DACR2               // bit 2
#define DACR3                   DACCON1bits.DACR3               // bit 3
#define DACR4                   DACCON1bits.DACR4               // bit 4

#define FVRBUFSS                FVRCONbits.FVRBUFSS             // bit 4
#define FVRBUFEN                FVRCONbits.FVRBUFEN             // bit 5
#define FVRRDY                  FVRCONbits.FVRRDY               // bit 6
#define FVREN                   FVRCONbits.FVREN                // bit 7

#define H1CKPS0                 HLT1CON0bits.H1CKPS0            // bit 0
#define H1CKPS1                 HLT1CON0bits.H1CKPS1            // bit 1
#define H1ON                    HLT1CON0bits.H1ON               // bit 2
#define H1OUTPS0                HLT1CON0bits.H1OUTPS0           // bit 3
#define H1OUTPS1                HLT1CON0bits.H1OUTPS1           // bit 4
#define H1OUTPS2                HLT1CON0bits.H1OUTPS2           // bit 5
#define H1OUTPS3                HLT1CON0bits.H1OUTPS3           // bit 6

#define H1REREN                 HLT1CON1bits.H1REREN            // bit 0
#define H1FEREN                 HLT1CON1bits.H1FEREN            // bit 1
#define H1ERS0                  HLT1CON1bits.H1ERS0             // bit 2
#define H1ERS1                  HLT1CON1bits.H1ERS1             // bit 3
#define H1ERS2                  HLT1CON1bits.H1ERS2             // bit 4

#define IOCIF                   INTCONbits.IOCIF                // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2
#define IOCIE                   INTCONbits.IOCIE                // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCAF0                  IOCAFbits.IOCAF0                // bit 0
#define IOCAF1                  IOCAFbits.IOCAF1                // bit 1
#define IOCAF2                  IOCAFbits.IOCAF2                // bit 2
#define IOCAF3                  IOCAFbits.IOCAF3                // bit 3
#define IOCAF4                  IOCAFbits.IOCAF4                // bit 4
#define IOCAF5                  IOCAFbits.IOCAF5                // bit 5

